sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/usb_examples/usb_device_msc_ramdisk/freertos/pin_mux.c
    const port_pin_config_t port0_27_pin134_config = {/* Internal pull-up/down resistor is disabled */
                                                      .pullSelect = kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      .pullValueSelect = kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      .slewRate = kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      .driveStrength = kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      .driveStrength1 = kPORT_NormalDriveStrength,
                                                      /* Pin is configured as LCD_P31 */
                                                      .mux = kPORT_MuxAlt9,
                                                      /* Digital input enabled */
                                                      .inputBuffer = kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      .invertInput = kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      .lockRegister = kPORT_UnlockRegister};
    /* PORT0_27 (pin 134) is configured as LCD_P31 */
    PORT_SetPinConfig(PORT0, 27U, &port0_27_pin134_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexioMculcdPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '59', peripheral: GPIO2, signal: 'GPIO, 24', pin_signal: P2_24/TRIG_OUT6/CT_INP8/ADC2_A3, direction: INPUT}
  - {pin_num: '24', peripheral: GPIO4, signal: 'GPIO, 3', pin_signal: P4_3/LPI2C2_SCL/LPUART4_TXD/CT4_MAT1/PWM0_B2/FLEXIO0_D11/SmartDMA_PIO23/ADC2_A19, direction: OUTPUT}
  - {pin_num: '22', peripheral: GPIO4, signal: 'GPIO, 1', pin_signal: P4_1/PWM0_B3/FLEXIO0_D9/SmartDMA_PIO21/ADC2_A17, direction: OUTPUT}
  - {pin_num: '88', peripheral: GPIO3, signal: 'GPIO, 16', pin_signal: P3_16/LPUART4_RTS_B/CT_INP8/FLEXIO0_D24/PWM1_A0/LCD_P44/SmartDMA_PIO16, direction: OUTPUT}
  - {pin_num: '60', peripheral: GPIO2, signal: 'GPIO, 25', pin_signal: P2_25/TRIG_OUT7/CT_INP9/ADC3_A3, direction: INPUT}
  - {pin_num: '116', peripheral: FLEXIO0, signal: 'D, 7', pin_signal: P0_7/WUU0_IN1/CT_INP3/FLEXIO0_D7/SmartDMA_PIO3/ADC2_A11/CMP2_IN1}
  - {pin_num: '21', peripheral: FLEXIO0, signal: 'D, 8', pin_signal: P4_0/TRIG_IN5/PWM0_A3/FLEXIO0_D8/SmartDMA_PIO20/ADC2_A16}
  - {pin_num: '41', peripheral: FLEXIO0, signal: 'D, 16', pin_signal: P2_8/TRIG_OUT3/CT3_MAT0/FLEXIO0_D16}
  - {pin_num: '42', peripheral: FLEXIO0, signal: 'D, 17', pin_signal: P2_9/TRIG_IN4/CT3_MAT1/FLEXIO0_D17}
  - {pin_num: '43', peripheral: FLEXIO0, signal: 'D, 18', pin_signal: P2_10/TRIG_OUT5/LPUART2_TXD/CT3_MAT2/FLEXIO0_D18/SmartDMA_PIO14/ADC2_A1}
  - {pin_num: '44', peripheral: FLEXIO0, signal: 'D, 19', pin_signal: P2_11/TRIG_IN4/LPUART2_RXD/CT3_MAT3/FLEXIO0_D19/SmartDMA_PIO15/ADC3_A1}
  - {pin_num: '92', peripheral: FLEXIO0, signal: 'D, 20', pin_signal: P3_12/LPUART2_RTS_B/LPUART3_TXD/CT1_MAT2/PWM0_X0/FLEXIO0_D20/PWM1_A2/LCD_P40/SmartDMA_PIO12/ADC3_A14}
  - {pin_num: '91', peripheral: FLEXIO0, signal: 'D, 21', pin_signal: P3_13/LPUART2_CTS_B/LPUART3_RXD/CT1_MAT3/PWM0_X1/FLEXIO0_D21/PWM1_B2/LCD_P41/SmartDMA_PIO13/ADC3_A15}
  - {pin_num: '49', peripheral: FLEXIO0, signal: 'D, 22', pin_signal: P2_14/CT4_MAT2/FLEXIO0_D22}
  - {pin_num: '8', peripheral: FLEXIO0, signal: 'D, 23', pin_signal: P1_15/WUU0_IN13/LPI2C1_SDAS/LPUART2_CTS_B/CT3_MAT1/FLEXIO0_D23/SmartDMA_PIO11/LCD_P13/ADC1_A13}
  - {pin_num: '77', peripheral: FLEXIO0, signal: 'D, 24', pin_signal: P3_24/TRIG_IN11/CT_INP16/FLEXIO0_D24/SmartDMA_PIO24/ADC3_A22}
  - {pin_num: '76', peripheral: FLEXIO0, signal: 'D, 25', pin_signal: P3_25/TRIG_OUT6/CT_INP15/FLEXIO0_D25/SmartDMA_PIO25/ADC3_A23}
  - {pin_num: '53', peripheral: FLEXIO0, signal: 'D, 26', pin_signal: P2_18/CT3_MAT2/FLEXIO0_D26}
  - {pin_num: '12', peripheral: FLEXIO0, signal: 'D, 27', pin_signal: P1_19/WUU0_IN15/FREQME_CLK_IN1/CT3_MAT1/FLEXIO0_D27/SmartDMA_PIO15/LPUART5_CTS_B/CAN0_RXD/ADC1_A17}
  - {pin_num: '83', peripheral: FLEXIO0, signal: 'D, 28', pin_signal: P3_20/TRIG_OUT0/LPI2C3_SDA/LPUART1_RXD/CT2_MAT2/PWM0_X2/FLEXIO0_D28/PWM1_A3/SmartDMA_PIO20/ADC3_A18}
  - {pin_num: '72', peripheral: FLEXIO0, signal: 'D, 29', pin_signal: P3_29/WUU0_IN27/ISPMODE_N/LPI2C3_HREQ/CT_INP3/CT3_MAT3/FLEXIO0_D29/SmartDMA_PIO29/ADC1_A22}
  - {pin_num: '57', peripheral: FLEXIO0, signal: 'D, 30', pin_signal: P2_22/CT2_MAT2/FLEXIO0_D30}
  - {pin_num: '80', peripheral: FLEXIO0, signal: 'D, 31', pin_signal: P3_23/LPUART1_CTS_B/CT_INP11/FLEXIO0_D31/PWM1_X3/SmartDMA_PIO23/ADC3_A21}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioMculcdPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioMculcdPins(void)
{
    /* GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* GPIO4: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO4);
    /* PORT0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* PORT4: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT4);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* GPIO4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO4_RST_SHIFT_RSTn);
    /* FLEXIO0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kFLEXIO0_RST_SHIFT_RSTn);
    /* PORT0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /* PORT4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT4_RST_SHIFT_RSTn);

    gpio_pin_config_t gpio2_pin59_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_24 (pin 59)  */
    GPIO_PinInit(GPIO2, 24U, &gpio2_pin59_config);

