sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/usb_examples/usb_device_msc_ramdisk/freertos/pin_mux.c
    /* PORT3_16 (pin 88) is configured as P3_16 */
    PORT_SetPinMux(PORT3, 16U, kPORT_MuxAlt0);

    PORT3->PCR[16] = ((PORT3->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_20 (pin 83) is configured as FLEXIO0_D28 */
    PORT_SetPinMux(PORT3, 20U, kPORT_MuxAlt6);

    PORT3->PCR[20] = ((PORT3->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_23 (pin 80) is configured as FLEXIO0_D31 */
    PORT_SetPinMux(PORT3, 23U, kPORT_MuxAlt6);

    PORT3->PCR[23] = ((PORT3->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_24 (pin 77) is configured as FLEXIO0_D24 */
    PORT_SetPinMux(PORT3, 24U, kPORT_MuxAlt6);

    PORT3->PCR[24] = ((PORT3->PCR[24] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_25 (pin 76) is configured as FLEXIO0_D25 */
    PORT_SetPinMux(PORT3, 25U, kPORT_MuxAlt6);

    PORT3->PCR[25] = ((PORT3->PCR[25] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_29 (pin 72) is configured as FLEXIO0_D29 */
    PORT_SetPinMux(PORT3, 29U, kPORT_MuxAlt6);

    PORT3->PCR[29] = ((PORT3->PCR[29] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT4->PCR[0] = ((PORT4->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT4_0 (pin 21) is configured as FLEXIO0_D8. */
                     | PORT_PCR_MUX(PORT4_PCR0_MUX_mux110)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT4->PCR[1] = ((PORT4->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT4_1 (pin 22) is configured as P4_1. */
                     | PORT_PCR_MUX(PORT4_PCR1_MUX_mux00)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT4->PCR[3] = ((PORT4->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT4_3 (pin 24) is configured as P4_3. */
                     | PORT_PCR_MUX(PORT4_PCR3_MUX_mux00)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexioCameraPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '113', peripheral: SmartDMA0, signal: 'SMARTDMA_PIO, 0', pin_signal: P0_4/WUU0_IN0/CT0_MAT2/UTICK_CAP2/FLEXIO0_D4/SmartDMA_PIO0/CMP1_OUT/ADC2_A9}
  - {pin_num: '114', peripheral: SmartDMA0, signal: 'SMARTDMA_PIO, 1', pin_signal: P0_5/CT0_MAT3/UTICK_CAP3/FLEXIO0_D5/SmartDMA_PIO1/CMP2_OUT/ADC2_A10}
  - {pin_num: '104', peripheral: SmartDMA0, signal: 'SMARTDMA_PIO, 2', pin_signal: P3_2/LPSPI1_PCS1/CT4_MAT0/PWM0_X0/FLEXIO0_D10/PWM1_X2/SmartDMA_PIO2/ADC3_A8}
  - {pin_num: '103', peripheral: SmartDMA0, signal: 'SMARTDMA_PIO, 3', pin_signal: P3_3/CT4_MAT1/PWM0_X1/FLEXIO0_D11/PWM1_X3/SmartDMA_PIO3/ADC3_A9}
  - {pin_num: '102', peripheral: SmartDMA0, signal: 'SMARTDMA_PIO, 4', pin_signal: P3_4/CT_INP18/PWM0_X2/FLEXIO0_D12/SmartDMA_PIO4/ADC3_A10}
  - {pin_num: '101', peripheral: SmartDMA0, signal: 'SMARTDMA_PIO, 5', pin_signal: P3_5/CT_INP19/PWM0_X3/FLEXIO0_D13/SmartDMA_PIO5/ADC3_A11}
  - {pin_num: '100', peripheral: SmartDMA0, signal: 'SMARTDMA_PIO, 6', pin_signal: P3_6/CLKOUT/LPSPI1_PCS3/LPUART3_RTS_B/CT4_MAT2/PWM0_A3/FLEXIO0_D14/PWM1_A0/LCD_P34/SmartDMA_PIO6/FREQME_CLK_OUT1/ADC3_A12}
  - {pin_num: '99', peripheral: SmartDMA0, signal: 'SMARTDMA_PIO, 7', pin_signal: P3_7/TRIG_IN2/LPSPI1_PCS2/LPUART3_CTS_B/CT4_MAT3/PWM0_B3/FLEXIO0_D15/PWM1_B0/LCD_P35/SmartDMA_PIO7/ADC3_A13}
  - {pin_num: '23', peripheral: SYSCON, signal: CLKOUT, pin_signal: P4_2/WUU0_IN16/CLKOUT/LPI2C2_SDAS/LPUART3_RXD/CT4_MAT0/PWM0_A2/FLEXIO0_D10/SmartDMA_PIO22/ADC2_A18}
  - {pin_num: '61', peripheral: GPIO2, signal: 'GPIO, 26', pin_signal: P2_26/TRIG_IN5/CT_INP10, direction: INPUT, gpio_per_interrupt: kGPIO_ActiveHighTriggerOutputEnable}
  - {pin_num: '75', peripheral: GPIO3, signal: 'GPIO, 26', pin_signal: P3_26/TRIG_IN10/CT_INP14/FLEXIO0_D26/SmartDMA_PIO26, direction: INPUT, gpio_per_interrupt: kGPIO_ActiveHighTriggerOutputEnable}
  - {pin_num: '27', peripheral: GPIO4, signal: 'GPIO, 6', pin_signal: P4_6/TRIG_IN4/LPI2C2_HREQ/LPUART3_CTS_B/CT_INP6/PWM0_A0/FLEXIO0_D14/SmartDMA_PIO26/ADC2_A22,
    direction: INPUT, gpio_per_interrupt: kGPIO_ActiveHighTriggerOutputEnable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioCameraPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioCameraPins(void)
{
    /* GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* GPIO4: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO4);
    /* PORT0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* PORT4: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT4);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* GPIO4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO4_RST_SHIFT_RSTn);
    /* PORT0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /* PORT4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT4_RST_SHIFT_RSTn);

    gpio_pin_config_t gpio2_pin61_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_26 (pin 61)  */
    GPIO_PinInit(GPIO2, 26U, &gpio2_pin61_config);

