sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/usb_examples/usb_device_msc_ramdisk/freertos/pin_mux.c
    gpio_pin_config_t gpio3_pin75_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_26 (pin 75)  */
    GPIO_PinInit(GPIO3, 26U, &gpio3_pin75_config);

    gpio_pin_config_t gpio4_pin27_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_6 (pin 27)  */
    GPIO_PinInit(GPIO4, 6U, &gpio4_pin27_config);

    /* Interrupt configuration on GPIO2_26 (pin 61): Enable active high-trigger output */
    GPIO_SetPinInterruptConfig(GPIO2, 26U, kGPIO_ActiveHighTriggerOutputEnable);

    /* Interrupt configuration on GPIO3_26 (pin 75): Enable active high-trigger output */
    GPIO_SetPinInterruptConfig(GPIO3, 26U, kGPIO_ActiveHighTriggerOutputEnable);

    /* Interrupt configuration on GPIO4_6 (pin 27): Enable active high-trigger output */
    GPIO_SetPinInterruptConfig(GPIO4, 6U, kGPIO_ActiveHighTriggerOutputEnable);

    /* PORT0_4 (pin 113) is configured as SmartDMA_PIO0 */
    PORT_SetPinMux(PORT0, 4U, kPORT_MuxAlt7);

    PORT0->PCR[4] = ((PORT0->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_5 (pin 114) is configured as SmartDMA_PIO1 */
    PORT_SetPinMux(PORT0, 5U, kPORT_MuxAlt7);

    PORT0->PCR[5] = ((PORT0->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[26] = ((PORT2->PCR[26] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_26 (pin 61) is configured as P2_26. */
                      | PORT_PCR_MUX(PORT2_PCR26_MUX_mux00)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_2 (pin 104) is configured as SmartDMA_PIO2 */
    PORT_SetPinMux(PORT3, 2U, kPORT_MuxAlt10);

    PORT3->PCR[2] = ((PORT3->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_26 (pin 75) is configured as P3_26 */
    PORT_SetPinMux(PORT3, 26U, kPORT_MuxAlt0);

    PORT3->PCR[26] = ((PORT3->PCR[26] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_3 (pin 103) is configured as SmartDMA_PIO3 */
    PORT_SetPinMux(PORT3, 3U, kPORT_MuxAlt10);

    PORT3->PCR[3] = ((PORT3->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_4 (pin 102) is configured as SmartDMA_PIO4 */
    PORT_SetPinMux(PORT3, 4U, kPORT_MuxAlt10);

    PORT3->PCR[4] = ((PORT3->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_5 (pin 101) is configured as SmartDMA_PIO5 */
    PORT_SetPinMux(PORT3, 5U, kPORT_MuxAlt10);

    PORT3->PCR[5] = ((PORT3->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_6 (pin 100) is configured as SmartDMA_PIO6 */
    PORT_SetPinMux(PORT3, 6U, kPORT_MuxAlt10);

    PORT3->PCR[6] = ((PORT3->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_7 (pin 99) is configured as SmartDMA_PIO7 */
    PORT_SetPinMux(PORT3, 7U, kPORT_MuxAlt10);

    PORT3->PCR[7] = ((PORT3->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT4->PCR[2] = ((PORT4->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT4_2 (pin 23) is configured as CLKOUT. */
                     | PORT_PCR_MUX(PORT4_PCR2_MUX_mux01)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT4->PCR[6] = ((PORT4->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT4_6 (pin 27) is configured as P4_6. */
                     | PORT_PCR_MUX(PORT4_PCR6_MUX_mux00)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexioMculcdSmartdmaTrigger:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {peripheral: SmartDMA0, signal: 'TRIG, 0', pin_signal: flexio_irq}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioMculcdSmartdmaTrigger
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioMculcdSmartdmaTrigger(void)
{
    /* INPUTMUX0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateINPUTMUX0);
    /* INPUTMUX0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /*  FlexioIrq connect to Smartdma0Trigger 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_FlexioIrqToSmartdma0Trigger);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexioCameraSmartdmaTrigger:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {peripheral: SmartDMA0, signal: 'TRIG, 0', pin_signal: gpio2_pin_event_trig}
  - {peripheral: SmartDMA0, signal: 'TRIG, 1', pin_signal: gpio3_pin_event_trig}
  - {peripheral: SmartDMA0, signal: 'TRIG, 2', pin_signal: gpio4_pin_event_trig}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

